# TargetUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ACADExportOptions..::..TargetUnit Property
ACADExportOptions Class See Also
---
The target unit type. Default value is ExportUnit.Default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportUnit TargetUnit { get; set; }
```

Visual Basic
---
```text
Public Property TargetUnit As ExportUnit
	Get
	Set
```

Visual C++
---
```text
public:
property ExportUnit TargetUnit {
	ExportUnit get ();
	void set (ExportUnit value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace